### P84

# pandas

- panel data analysis - 구조화된 데이터 분석
    
- 4.1. 데이터프레임
- 4.2. 그래프
- 4.3. 데이터프레임 연습

    - 데이터프레임(DataFrame) 행(로우)과 열(컬럼)
    - 시리즈(Series) - 컬럼(열)이 하나뿐인 데이터프레임

### 4.1 데이터프레임

- 테이블 구조로 데이터 처리
- pandas : panel data analysis - 구조화된 데이터 분석

# 기본기능

In [1]:
import numpy as np
import pandas as pd

# DataFrame - 데이터프레임

In [7]:
# DataFrame 함수를 이용하여 딕셔너리 타입의 데이터로 부터 데이터프레임을 만드는 예
dic = {'city': ['서울', '부산', '대전', '대구', '광주'],
       'year': [2017, 2017, 2018, 2018, 2018],
       'temp': [18, 20, 19, 21, 20]}
dic

{'city': ['서울', '부산', '대전', '대구', '광주'],
 'year': [2017, 2017, 2018, 2018, 2018],
 'temp': [18, 20, 19, 21, 20]}

In [6]:
data=pd.DataFrame(dic)
data

  city  year  temp
0   서울  2017    18
1   부산  2017    20
2   대전  2018    19
3   대구  2018    21
4   광주  2018    20

In [8]:
print(data)

  city  year  temp
0   서울  2017    18
1   부산  2017    20
2   대전  2018    19
3   대구  2018    21
4   광주  2018    20

### 인덱싱 번호 0~4번 자동으로 부여

In [10]:
#컬렴 열 순서 바꾸기 -> 원본 데이터 수정없이 바로 실행
data[['year','city','temp']]

   year city  temp
0  2017   서울    18
1  2017   부산    20
2  2018   대전    19
3  2018   대구    21
4  2018   광주    20

# 인덱스

In [12]:
#행 이름 변경
data.index=['a','b','c','d','e'] # 원본 또 한 수정됨.
data

  city  year  temp
a   서울  2017    18
b   부산  2017    20
c   대전  2018    19
d   대구  2018    21
e   광주  2018    20

In [13]:
#열이름 변경
data.columns=['도시','연도','날씨']
data

   도시    연도  날씨
a  서울  2017  18
b  부산  2017  20
c  대전  2018  19
d  대구  2018  21
e  광주  2018  20

# 특정 열을 출력

### 1. 열이름으로 접근 : 변수명[['열이름']]
### 2.속성값으로 접근 : 변수명.컬럼명

In [14]:
data[['연도']]

     연도
a  2017
b  2017
c  2018
d  2018
e  2018

In [15]:
data['연도'] # pandas.series 형태 - 속성값으로 접근 방법과 동일 출력

a    2017
b    2017
c    2018
d    2018
e    2018
Name: 연도, dtype: int64

In [16]:
data.연도

a    2017
b    2017
c    2018
d    2018
e    2018
Name: 연도, dtype: int64

In [18]:
col_1=data[['도시']]
col_1

   도시
a  서울
b  부산
c  대전
d  대구
e  광주

In [21]:
col_2=data[['도시','날씨']]
col_2

   도시  날씨
a  서울  18
b  부산  20
c  대전  19
d  대구  21
e  광주  20

In [22]:
col_3=data[['연도','도시','날씨']]
col_3

     연도  도시  날씨
a  2017  서울  18
b  2017  부산  20
c  2018  대전  19
d  2018  대구  21
e  2018  광주  20

# 특정 행(row), 열(column)을 출력 방법
- 인덱스(번호 o r명)를 사용하는 방법 - loc 사용
- 인덱스가 아니라 (행/열)의 위치를 지정하는 방법 - iloc

In [23]:
data

   도시    연도  날씨
a  서울  2017  18
b  부산  2017  20
c  대전  2018  19
d  대구  2018  21
e  광주  2018  20

- loc: 인덱스 이름으로
- iloc : 행 열 로

In [25]:
# loc
# loc['인덱스 이름(번호) <=> ['이름'] : 특정 인덱스 이름 행(row)을 출력
data.loc['b']

도시      부산
연도    2017
날씨      20
Name: b, dtype: object

In [29]:
#iloc - 자격증 시험에 잘 나옴 반드시 나온데.
#data.iloc[2,2]
data.iloc[1:3]

   도시    연도  날씨
b  부산  2017  20
c  대전  2018  19

In [30]:
data.iloc[0:,2]

a    18
b    20
c    19
d    21
e    20
Name: 날씨, dtype: int64

In [32]:
data.iloc[2,2]

19

### ☞ 특정 위치 값 출력
1. iloc[a,b]  : 'a'인덱스행번호 와 'b'인덱스열 번호가 교차하는 위치 값
2.  loc[x,y]  : x인덱스 행이름과 y 인덱스 열아름이 교차하는 위치 값

In [33]:
data

   도시    연도  날씨
a  서울  2017  18
b  부산  2017  20
c  대전  2018  19
d  대구  2018  21
e  광주  2018  20

In [34]:
print(data.iloc[2,2])

19

# set_index 
- 새로운 변수에 저장
- inplace=True /저장 덮어씀

In [35]:
# 새로운 변수에 저장
# 변수명.index("","","") : 인덱스 이름 변경 
# data.set_index(['열명']) : 열(컬럼)을 인덱스로 대체
data_set=data.set_index(['도시']) 
data_set

      연도  날씨
도시
서울  2017  18
부산  2017  20
대전  2018  19
대구  2018  21
광주  2018  20

In [36]:
data

   도시    연도  날씨
a  서울  2017  18
b  부산  2017  20
c  대전  2018  19
d  대구  2018  21
e  광주  2018  20

In [47]:
# inplace = False 지정 or 생략(저장 안 함 - 원본변경 없음)
# 변수명.set_index(['도시']

data.set_index(['도시'], inplace = False)
data  
# inplace 
# drop등의 메서드를 사용할 때, 변경 값(변경될 데이터 프레임)을 저장 할 때 사용
# inplace = False (저장 안 함 - 원본변경 없음)
# inplace = True (저장 함 - 원본변경)
# drop('', axis ='' , inplace='' )
# set 지정후 inplace=True 하지 않으면 인덱스 0,1,2,3,4 또는 a,b,c,d,e존재함

KeyError: "None of ['도시'] are in the columns"

In [48]:
# set_index 변환 출력
# inplace = True (저장 함 - 원본변경)
# 변수명.set_index(['도시']

data.set_index(['도시'], inplace = True)
data  
# inplace 
# drop등의 메서드를 사용할 때, 변경 값(변경될 데이터 프레임)을 저장 할 때 사용
# inplace = False (저장 안 함 - 원본변경 없음)
# inplace = True (저장 함 - 원본변경)
# drop('', axis ='' , inplace='' )
# set 지정후 inplace=True 하지 않으면 인덱스 0,1,2,3,4 또는 a,b,c,d,e존재함

KeyError: "None of ['도시'] are in the columns"

In [49]:
data

      연도  날씨
도시
서울  2017  18
부산  2017  20
대전  2018  19
대구  2018  21
광주  2018  20

In [50]:
data.iloc[:,1]

도시
서울    18
부산    20
대전    19
대구    21
광주    20
Name: 날씨, dtype: int64

In [55]:
data.iloc[2,1]

19

# 행 출력
- 인덱스 이름으로

In [57]:
#loc['서울']: 행 인덱스 이름으로 행 출력 
data.loc['서울']

연도    2017
날씨      18
Name: 서울, dtype: int64

In [58]:
#iloc : 행 위치로 출력
data.iloc[0]

연도    2017
날씨      18
Name: 서울, dtype: int64

In [60]:
data.iloc[1:2]

      연도  날씨
도시
부산  2017  20

# 열 추가

In [61]:
# car 새로운 칼럼 추가

cars = [50,40,20,30,10]

data['car'] = cars 

data

      연도  날씨  car
도시
서울  2017  18   50
부산  2017  20   40
대전  2018  19   20
대구  2018  21   30
광주  2018  20   10

In [62]:
#high라는 열이 존재하지 않으면 새로 생성 
data['high']= data.car>30 
data

      연도  날씨  car   high
도시
서울  2017  18   50   True
부산  2017  20   40   True
대전  2018  19   20  False
대구  2018  21   30  False
광주  2018  20   10  False

In [63]:
data['high']= data.날씨>=20 
data

      연도  날씨  car   high
도시
서울  2017  18   50  False
부산  2017  20   40   True
대전  2018  19   20  False
대구  2018  21   30   True
광주  2018  20   10   True

In [64]:
#high라는 열이 존재하지 않으면 새로 생성 
data['high']= data.car>=30 
data

      연도  날씨  car   high
도시
서울  2017  18   50   True
부산  2017  20   40   True
대전  2018  19   20  False
대구  2018  21   30   True
광주  2018  20   10  False

# 특정 칼럼 삭제 - 자격증 문제 나옴

# drop()
- data.drop('car', 1) - ('열명', 0: 행 기준 / 1: 열 기준)으로 삭제

In [65]:
data

      연도  날씨  car   high
도시
서울  2017  18   50   True
부산  2017  20   40   True
대전  2018  19   20  False
대구  2018  21   30   True
광주  2018  20   10  False

# 열 기준 삭제

In [67]:
# data.drop('car', 1) 1 : 열 기준
# 원본 data는 변화지 않음, 삭제 수정된 자료 저장시에는 새로운 변수에 저장
# .drop( , 1) 1 : 열을 기준 삭제 , drop( , 0) 0:행을 기준 삭제 drop() 행/열 삭제
# 합계,평균 등 내장 함수 axis = 1 :행, 0 :열 drop()과 반대
data.drop('car',1)

/var/folders/gx/c5n136_505zct9pkpb8s4ry80000gn/T/ipykernel_6636/3683841511.py:5: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  data.drop('car',1)

      연도  날씨   high
도시
서울  2017  18   True
부산  2017  20   True
대전  2018  19  False
대구  2018  21   True
광주  2018  20  False

In [68]:
data

      연도  날씨  car   high
도시
서울  2017  18   50   True
부산  2017  20   40   True
대전  2018  19   20  False
대구  2018  21   30   True
광주  2018  20   10  False

In [69]:
data.drop(['car','high'],axis=1) #1: 열기준 삭제

      연도  날씨
도시
서울  2017  18
부산  2017  20
대전  2018  19
대구  2018  21
광주  2018  20

# 행 기준 삭제 - drop 아주중요하데

In [70]:
data.drop(['대전','광주'],axis=0) #행 기준으로 삭제

      연도  날씨  car  high
도시
서울  2017  18   50  True
부산  2017  20   40  True
대구  2018  21   30  True

In [71]:
data_11 = data.drop(['대전', '광주'], 0) # 수정된 자료를 저장할 시에는 새로운 변수에 할당 저장해야됨 
data_11

/var/folders/gx/c5n136_505zct9pkpb8s4ry80000gn/T/ipykernel_6636/889799043.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  data_11 = data.drop(['대전', '광주'], 0) # 수정된 자료를 저장할 시에는 새로운 변수에 할당 저장해야됨

      연도  날씨  car  high
도시
서울  2017  18   50  True
부산  2017  20   40  True
대구  2018  21   30  True

# apply():  # 이것도 중요함 별표 두개 세개 정도  시험에 10번중 9번 나옴
- 전체 데이터 프레임이나 특정 컬럼의 값을 편리하게 데이터를 일괄 적용하는 함수

- (최대값-최소값)을 계산하는 함수를 정의하고 이를 데이터에 적용하는 예

- 행에 대해서 함수를적용하려면 (즉,좌에서 우로 수행) 인자 axis=1로 지정한다.

- 람다 함수

In [76]:
f = lambda x: x.max() -x.min()

df=pd.DataFrame(np.arange(12).reshape(4,3),columns=['A','B','C'],index=['a','b','c','d'])
df

   A   B   C
a  0   1   2
b  3   4   5
c  6   7   8
d  9  10  11

In [74]:
df.apply(f,axis=0)

A    9
B    9
C    9
dtype: int64

In [75]:
df.apply(f,1)

a    2
b    2
c    2
d    2
dtype: int64

In [77]:
# Series
# 판다스는 시리즈(Series)객체를 제공, 컬럼이 하나뿐인 특수한 구조의 데이터프레임.
# Series 열지정 옵션 불가
# Series의 기본 구조는 index와 그 index에 맵핑에 되는 values 값이 존재.
# Series(values 값 , index = index 값) 

region = pd.Series(['서울', '부산', '대전', '대구','광주'],index=['1','2','3','4','5'])  # 지역

print(region)

#실제로 위치는 0 인덱스 행인거 주위하기

1    서울
2    부산
3    대전
4    대구
5    광주
dtype: object

In [79]:
dic = {'서울':800,'부산':150,'대구':100}
dic

{'서울': 800, '부산': 150, '대구': 100}

In [81]:
s=pd.Series(dic)
s

서울    800
부산    150
대구    100
dtype: int64